spec/load-test/load_test_service.yml
config:
  target: "http://localhost:3210"
  processor: './artilleryFunc.js'
  phases:
    - duration: 10
      arrivalRate: 1
      maxVusers: 1
      name: Warm up

    - pause: 60

    - duration: 60
      arrivalRate: 10
      maxVusers: 10
      name: Ramp up to 10 users

    - pause: 60

    - duration: 60
      arrivalRate: 100
      maxVusers: 100
      name: Ramp up to 100 users

    - pause: 60

    - duration: 120
      arrivalRate: 100
      maxVusers: 1000
      name: Ramp up to 1000 users

    - pause: 60

    - duration: 120
      arrivalRate: 200
      maxVusers: 10000
      name: Ramp up to 10000 users

scenarios:
  # We define one scenario:
  - name: "Get products"
    flow:
      - function: "randomNumber"
      # Get the details of the product:
      - get:
          url: "/sb/api/item/{{id}}"